# BuiltInFailures.ExternalResourceReferenceFailures Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..ExternalResourceReferenceFailures Members
BuiltInFailures..::..ExternalResourceReferenceFailures Class Properties See Also
---
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures..::..ExternalResourceReferenceFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ReferenceToLocalFile | The External Resource refers to a local file that may not be available to workshared users. |

# See Also
BuiltInFailures..::..ExternalResourceReferenceFailures Class
Autodesk.Revit.DB Namespace